[
  {
    "title": "从军行",
    "author": {
      "name": "杨炯",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "烽火照西京，心中自不平。\n牙璋辞凤阙，铁骑绕龙城。\n雪暗凋旗画，风多杂鼓声。\n宁为百夫长，胜作一书生。"
  },
  {
    "title": "浣溪沙·簌簌衣巾落枣花",
    "author": {
      "name": "苏轼",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "徐门石潭谢雨，道上作五首。潭在城东二十里，常与泗水增减清浊相应。\n簌簌衣巾落枣花，村南村北响缲车，牛衣古柳卖黄瓜。\n酒困路长惟欲睡，日高人渴漫思茶。敲门试问野人家。"
  },
  {
    "title": "白马篇",
    "author": {
      "name": "曹植",
      "dynasty": "魏"
    },
    "type": "poetry",
    "content": "白马饰金羁，连翩西北驰。\n借问谁家子，幽并游侠儿。\n少小去乡邑，扬声沙漠垂。\n宿昔秉良弓，楛矢何参差。\n控弦破左的，右发摧月支。\n仰手接飞猱，俯身散马蹄。\n狡捷过猴猿，勇剽若豹螭。\n边城多警急，虏骑数迁移。\n羽檄从北来，厉马登高堤。\n长驱蹈匈奴，左顾凌鲜卑。\n弃身锋刃端，性命安可怀？\n父母且不顾，何言子与妻！\n名编壮士籍，不得中顾私。\n捐躯赴国难，视死忽如归！"
  },
  {
    "title": "水龙吟·登建康赏心亭",
    "author": {
      "name": "辛弃疾",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "楚天千里清秋，水随天去秋无际。遥岑远目，献愁供恨，玉簪螺髻。落日楼头，断鸿声里，江南游子。把吴钩看了，栏杆拍遍，无人会，登临意。\n休说鲈鱼堪脍，尽西风，季鹰归未？求田问舍，怕应羞见，刘郎才气。可惜流年，忧愁风雨，树犹如此！倩何人唤取，红巾翠袖，揾英雄泪！"
  },
  {
    "title": "无题·昨夜星辰昨夜风",
    "author": {
      "name": "李商隐",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "昨夜星辰昨夜风，画楼西畔桂堂东。\n身无彩凤双飞翼，心有灵犀一点通。\n隔座送钩春酒暖，分曹射覆蜡灯红。\n嗟余听鼓应官去，走马兰台类转蓬。"
  },
  {
    "title": "除夜作",
    "author": {
      "name": "高适",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "旅馆寒灯独不眠，客心何事转凄然。\n故乡今夜思千里，霜鬓明朝又一年。"
  },
  {
    "title": "朝天子·咏喇叭",
    "author": {
      "name": "王磐",
      "dynasty": "明"
    },
    "type": "ancient",
    "content": "喇叭，唢呐，曲儿小腔儿大。官船来往乱如麻，全仗你抬声价。\n军听了军愁，民听了民怕。哪里去辨甚么真共假？\n眼见的吹翻了这家，吹伤了那家，只吹的水尽鹅飞罢！"
  },
  {
    "title": "劝学",
    "author": {
      "name": "荀子",
      "dynasty": "先秦"
    },
    "type": "ancient",
    "content": "君子曰：学不可以已。\n青，取之于蓝，而青于蓝；冰，水为之，而寒于水。木直中绳，輮以为轮，其曲中规。虽有槁暴，不复挺者，輮使之然也。故木受绳则直，金就砺则利，君子博学而日参省乎己，则知明而行无过矣。\n故不登高山，不知天之高也；不临深溪，不知地之厚也；不闻先王之遗言，不知学问之大也。干、越、夷、貉之子，生而同声，长而异俗，教使之然也。诗曰：“嗟尔君子，无恒安息。靖共尔位，好是正直。神之听之，介尔景福。”神莫大于化道，福莫长于无祸。\n吾尝终日而思矣，不如须臾之所学也；吾尝跂而望矣，不如登高之博见也。登高而招，臂非加长也，而见者远；顺风而呼，声非加疾也，而闻者彰。假舆马者，非利足也，而致千里；假舟楫者，非能水也，而绝江河。君子生非异也，善假于物也。(君子'生' 通：'性'\n南方有鸟焉，名曰蒙鸠，以羽为巢，而编之以发，系之苇苕，风至苕折，卵破子死。巢非不完也，所系者然也。西方有木焉，名曰射干，茎长四寸，生于高山之上，而临百仞之渊，木茎非能长也，所立者然也。蓬生麻中，不扶而直；白沙在涅，与之俱黑。兰槐之根是为芷，其渐之滫，君子不近，庶人不服。其质非不美也，所渐者然也。故君子居必择乡，游必就士，所以防邪辟而近中正也。\n物类之起，必有所始。荣辱之来，必象其德。肉腐出虫，鱼枯生蠹。怠慢忘身，祸灾乃作。强自取柱，柔自取束。邪秽在身，怨之所构。施薪若一，火就燥也，平地若一，水就湿也。草木畴生，禽兽群焉，物各从其类也。是故质的张，而弓矢至焉；林木茂，而斧斤至焉；树成荫，而众鸟息焉。醯酸，而蚋聚焉。故言有招祸也，行有招辱也，君子慎其所立乎！\n积土成山，风雨兴焉；积水成渊，蛟龙生焉；积善成德，而神明自得，圣心备焉。故不积跬步，无以至千里；不积小流，无以成江海。骐骥一跃，不能十步；驽马十驾，功在不舍。锲而舍之，朽木不折；锲而不舍，金石可镂。蚓无爪牙之利，筋骨之强，上食埃土，下饮黄泉，用心一也。蟹六跪而二螯，非蛇鳝之穴无可寄托者，用心躁也。\n是故无冥冥之志者，无昭昭之明；无惛惛之事者，无赫赫之功。行衢道者不至，事两君者不容。目不能两视而明，耳不能两听而聪。螣蛇无足而飞，鼫鼠五技而穷。诗曰：“尸鸠在桑，其子七兮。淑人君子，其仪一兮。其仪一兮，心如结兮！”故君子结于一也。\n昔者瓠巴鼓瑟，而流鱼出听；伯牙鼓琴，而六马仰秣。故声无小而不闻，行无隐而不形 。玉在山而草木润，渊生珠而崖不枯。为善不积邪？安有不闻者乎？\n学恶乎始？恶乎终？曰：其数则始乎诵经，终乎读礼；其义则始乎为士，终乎为圣人， 真积力久则入，学至乎没而后止也。故学数有终，若其义则不可须臾舍也。为之，人也；舍 之，禽兽也。故书者，政事之纪也；诗者，中声之所止也；礼者，法之大分，类之纲纪也。 故学至乎礼而止矣。夫是之谓道德之极。礼之敬文也，乐之中和也，诗书之博也，春秋之微 也，在天地之间者毕矣。 君子之学也，入乎耳，着乎心，布乎四体，形乎动静。端而言，蝡而动，一可以为法则。小人之学也，入乎耳，出乎口；口耳之间，则四寸耳，曷足以美七尺之躯哉！古之学者为己，今之学者为人。君子之学也，以美其身；小人之学也，以为禽犊。故不问而告谓之傲，问一而告二谓之囋。傲、非也，囋、非也；君子如向矣。\n学莫便乎近其人。礼乐法而不说，诗书故而不切，春秋约而不速。方其人之习君子之说，则尊以遍矣，周于世矣。故曰：学莫便乎近其人。\n学之经莫速乎好其人，隆礼次之。上不能好其人，下不能隆礼，安特将学杂识志，顺诗书而已耳。则末世穷年，不免为陋儒而已。将原先王，本仁义，则礼正其经纬蹊径也。若挈裘领，诎五指而顿之，顺者不可胜数也。不道礼宪，以诗书为之，譬之犹以指测河也，以戈舂黍也，以锥餐壶也，不可以得之矣。故隆礼，虽未明，法士也；不隆礼，虽察辩，散儒也。\n问楛者，勿告也；告楛者，勿问也；说楛者，勿听也。有争气者，勿与辩也。故必由其道至，然后接之；非其道则避之。故礼恭，而后可与言道之方；辞顺，而后可与言道之理；色从而后可与言道之致。故未可与言而言，谓之傲；可与言而不言，谓之隐；不观气色而言，谓瞽。故君子不傲、不隐、不瞽，谨顺其身。诗曰：“匪交匪舒，天子所予。”此之谓也。\n百发失一，不足谓善射；千里蹞步不至，不足谓善御；伦类不通，仁义不一，不足谓善学。学也者，固学一之也。一出焉，一入焉，涂巷之人也；其善者少，不善者多，桀纣盗跖也；全之尽之，然后学者也。\n君子知夫不全不粹之不足以为美也，故诵数以贯之，思索以通之，为其人以处之，除其害者以持养之。使目非是无欲见也，使耳非是无欲闻也，使口非是无欲言也，使心非是无欲虑也。及至其致好之也，目好之五色，耳好之五声，口好之五味，心利之有天下。是故权利不能倾也，群众不能移也，天下不能荡也。生乎由是，死乎由是，夫是之谓德操。德操然后能定，能定然后能应。能定能应，夫是之谓成人。天见其明，地见其光，君子贵其全也。"
  },
  {
    "title": "虞美人·听雨",
    "author": {
      "name": "蒋捷",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "少年听雨歌楼上。红烛昏罗帐。壮年听雨客舟中。江阔云低、断雁叫西风。\n而今听雨僧庐下。鬓已星星也。悲欢离合总无情。一任阶前、点滴到天明。"
  },
  {
    "title": "长相思·一重山",
    "author": {
      "name": "李煜",
      "dynasty": "五代"
    },
    "type": "poetry",
    "content": "一重山，两重山。山远天高烟水寒，相思枫叶丹。\n菊花开，菊花残。塞雁高飞人未还，一帘风月闲。"
  },
  {
    "title": "别董大二首",
    "author": {
      "name": "高适",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "千里黄云白日曛，北风吹雁雪纷纷。\n莫愁前路无知己，天下谁人不识君。\n六翮飘飖私自怜，一离京洛十余年。\n丈夫贫贱应未足，今日相逢无酒钱。"
  },
  {
    "title": "清明",
    "author": {
      "name": "黄庭坚",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "佳节清明桃李笑，野田荒冢只生愁。\n雷惊天地龙蛇蛰，雨足郊原草木柔。\n人乞祭余骄妾妇，士甘焚死不公侯。\n贤愚千载知谁是，满眼蓬蒿共一丘。"
  },
  {
    "title": "蝶恋花·槛菊愁烟兰泣露",
    "author": {
      "name": "晏殊",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "槛菊愁烟兰泣露，罗幕轻寒，燕子双飞去。明月不谙离恨苦，斜光到晓穿朱户。\n昨夜西风凋碧树，独上高楼，望尽天涯路。欲寄彩笺兼尺素，山长水阔知何处？"
  },
  {
    "title": "满江红·小住京华",
    "author": {
      "name": "秋瑾",
      "dynasty": "清"
    },
    "type": "ancient",
    "content": "小住京华，早又是，中秋佳节。为篱下，黄花开遍，秋容如拭。四面歌残终破楚，八年风味徒思浙。苦将侬，强派作蛾眉，殊未屑！\n身不得，男儿列。心却比，男儿烈！算平生肝胆，因人常热。俗子胸襟谁识我？英雄末路当磨折。莽红尘，何处觅知音？青衫湿！"
  },
  {
    "title": "击壤歌",
    "author": {
      "name": "佚名",
      "dynasty": "先秦"
    },
    "type": "poetry",
    "content": "日出而作，日入而息。\n凿井而饮，耕田而食。\n帝力于我何有哉！"
  },
  {
    "title": "望江南·梳洗罢",
    "author": {
      "name": "温庭筠",
      "dynasty": "唐"
    },
    "type": "ancient",
    "content": "梳洗罢，独倚望江楼。过尽千帆皆不是，斜晖脉脉水悠悠。肠断白蘋洲。"
  },
  {
    "title": "乐游原",
    "author": {
      "name": "李商隐",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "向晚意不适，驱车登古原。\n夕阳无限好，只是近黄昏。"
  },
  {
    "title": "越人歌",
    "author": {
      "name": "佚名",
      "dynasty": "先秦"
    },
    "type": "poetry",
    "content": "今夕何夕兮，搴舟中流。\n今日何日兮，得与王子同舟。\n蒙羞被好兮，不訾诟耻。\n心几烦而不绝兮，得知王子。\n山有木兮木有枝，心悦君兮君不知。"
  },
  {
    "title": "破阵子·春景",
    "author": {
      "name": "晏殊",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "燕子来时新社，梨花落后清明。池上碧苔三四点，叶底黄鹂一两声。日长飞絮轻。\n巧笑东邻女伴，采桑径里逢迎。疑怪昨宵春梦好，元是今朝斗草赢。笑从双脸生。"
  },
  {
    "title": "舟过安仁",
    "author": {
      "name": "杨万里",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "一叶渔船两小童，收篙停棹坐船中。\n怪生无雨都张伞，不是遮头是使风。"
  },
  {
    "title": "杂诗三首·其二",
    "author": {
      "name": "王维",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "君自故乡来，应知故乡事。\n来日绮窗前，寒梅著花未？"
  },
  {
    "title": "雪",
    "author": {
      "name": "罗隐",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "尽道丰年瑞，丰年事若何。\n长安有贫者，为瑞不宜多。"
  },
  {
    "title": "寻陆鸿渐不遇",
    "author": {
      "name": "皎然",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "移家虽带郭，野径入桑麻。\n近种篱边菊，秋来未著花。\n扣门无犬吠，欲去问西家。\n报道山中去，归时每日斜。"
  },
  {
    "title": "阳关曲·中秋月",
    "author": {
      "name": "苏轼",
      "dynasty": "宋"
    },
    "type": "poetry",
    "foreword": "中秋作本名小秦王，入腔即阳关曲",
    "content": "暮云收尽溢清寒，银汉无声转玉盘。\n此生此夜不长好，明月明年何处看。"
  },
  {
    "title": "蜂",
    "author": {
      "name": "罗隐",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "不论平地与山尖，无限风光尽被占。\n采得百花成蜜后，为谁辛苦为谁甜？"
  },
  {
    "title": "清平乐·年年雪里",
    "author": {
      "name": "李清照",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "年年雪里，常插梅花醉。挼尽梅花无好意，赢得满衣清泪。\n今年海角天涯，萧萧两鬓生华。看取晚来风势，故应难看梅花。"
  },
  {
    "title": "孔雀东南飞",
    "author": {
      "name": "佚名",
      "dynasty": "汉"
    },
    "type": "ancient",
    "foreword": "汉末建安中，庐江府小吏焦仲卿妻刘氏，为仲卿母所遣，自誓不嫁。其家逼之，乃投水而死。仲卿闻之，亦自缢于庭树。时人伤之，为诗云尔。",
    "content": "孔雀东南飞，五里一徘徊。\n“十三能织素，十四学裁衣。十五弹箜篌，十六诵诗书。十七为君妇，心中常苦悲。君既为府吏，守节情不移。贱妾留空房，相见常日稀。鸡鸣入机织，夜夜不得息。三日断五匹，大人故嫌迟。非为织作迟，君家妇难为！妾不堪驱使，徒留无所施。便可白公姥，及时相遣归。”\n府吏得闻之，堂上启阿母：“儿已薄禄相，幸复得此妇。结发同枕席，黄泉共为友。共事二三年，始尔未为久。女行无偏斜，何意致不厚。”\n阿母谓府吏：“何乃太区区！此妇无礼节，举动自专由。吾意久怀忿，汝岂得自由！东家有贤女，自名秦罗敷。可怜体无比，阿母为汝求。便可速遣之，遣去慎莫留！”\n府吏长跪告：“伏惟启阿母。今若遣此妇，终老不复取！”\n阿母得闻之，槌床便大怒：“小子无所畏，何敢助妇语！吾已失恩义，会不相从许！”\n府吏默无声，再拜还入户。举言谓新妇，哽咽不能语：“我自不驱卿，逼迫有阿母。卿但暂还家，吾今且报府。不久当归还，还必相迎取。以此下心意，慎勿违吾语。”\n新妇谓府吏：“勿复重纷纭。往昔初阳岁，谢家来贵门。奉事循公姥，进止敢自专？昼夜勤作息，伶俜萦苦辛。谓言无罪过，供养卒大恩；仍更被驱遣，何言复来还！妾有绣腰襦，葳蕤自生光；红罗复斗帐，四角垂香囊；箱帘六七十，绿碧青丝绳，物物各自异，种种在其中。人贱物亦鄙，不足迎后人，留待作遗施，于今无会因。时时为安慰，久久莫相忘！”\n鸡鸣外欲曙，新妇起严妆。著我绣夹裙，事事四五通。足下蹑丝履，头上玳瑁光。腰若流纨素，耳著明月珰。指如削葱根，口如含朱丹。纤纤作细步，精妙世无双。\n上堂拜阿母，阿母怒不止。“昔作女儿时，生小出野里。本自无教训，兼愧贵家子。受母钱帛多，不堪母驱使。今日还家去，念母劳家里。”却与小姑别，泪落连珠子。“新妇初来时，小姑始扶床；今日被驱遣，小姑如我长。勤心养公姥，好自相扶将。初七及下九，嬉戏莫相忘。”出门登车去，涕落百余行。\n府吏马在前，新妇车在后。隐隐何甸甸，俱会大道口。下马入车中，低头共耳语：“誓不相隔卿，且暂还家去。吾今且赴府，不久当还归。誓天不相负！”\n新妇谓府吏：“感君区区怀！君既若见录，不久望君来。君当作磐石，妾当作蒲苇。蒲苇纫如丝，磐石无转移。我有亲父兄，性行暴如雷，恐不任我意，逆以煎我怀。”举手长劳劳，二情同依依 。\n入门上家堂，进退无颜仪。阿母大拊掌，不图子自归：“十三教汝织，十四能裁衣，十五弹箜篌，十六知礼仪，十七遣汝嫁，谓言无誓违。汝今何罪过，不迎而自归？”兰芝惭阿母：“儿实无罪过。”阿母大悲摧。\n还家十余日，县令遣媒来。云有第三郎，窈窕世无双。年始十八九，便言多令才。\n阿母谓阿女：“汝可去应之。”\n阿女含泪答：“兰芝初还时，府吏见丁宁，结誓不别离。今日违情义，恐此事非奇。自可断来信，徐徐更谓之。”\n阿母白媒人：“贫贱有此女，始适还家门。不堪吏人妇，岂合令郎君？幸可广问讯，不得便相许。”\n媒人去数日，寻遣丞请还，说有兰家女，承籍有宦官。云有第五郎，娇逸未有婚。遣丞为媒人，主簿通语言。直说太守家，有此令郎君，既欲结大义，故遣来贵门。\n阿母谢媒人：“女子先有誓，老姥岂敢言！”\n阿兄得闻之，怅然心中烦。举言谓阿妹：“作计何不量！先嫁得府吏，后嫁得郎君。否泰如天地，足以荣汝身。不嫁义郎体，其往欲何云？”\n兰芝仰头答：“理实如兄言。谢家事夫婿，中道还兄门。处分适兄意，那得自任专！虽与府吏要，渠会永无缘。登即相许和，便可作婚姻。”\n媒人下床去。诺诺复尔尔。还部白府君：“下官奉使命，言谈大有缘。”府君得闻之，心中大欢喜。视历复开书，便利此月内，六合正相应。良吉三十日，今已二十七，卿可去成婚。交语速装束，络绎如浮云。青雀白鹄舫，四角龙子幡。婀娜随风转，金车玉作轮。踯躅青骢马，流苏金镂鞍。赍钱三百万，皆用青丝穿。杂彩三百匹，交广市鲑珍。从人四五百，郁郁登郡门。\n阿母谓阿女：“适得府君书，明日来迎汝。何不作衣裳？莫令事不举！”\n阿女默无声，手巾掩口啼，泪落便如泻。移我琉璃榻，出置前窗下。左手持刀尺，右手执绫罗。朝成绣夹裙，晚成单罗衫。晻晻日欲暝，愁思出门啼。\n府吏闻此变，因求假暂归。未至二三里，摧藏马悲哀。新妇识马声，蹑履相逢迎。怅然遥相望，知是故人来。举手拍马鞍，嗟叹使心伤：“自君别我后，人事不可量。果不如先愿，又非君所详。我有亲父母，逼迫兼弟兄。以我应他人，君还何所望！”\n府吏谓新妇：“贺卿得高迁！磐石方且厚，可以卒千年；蒲苇一时纫，便作旦夕间。卿当日胜贵，吾独向黄泉！”\n新妇谓府吏：“何意出此言！同是被逼迫，君尔妾亦然。黄泉下相见，勿违今日言！”执手分道去，各各还家门。生人作死别，恨恨那可论？念与世间辞，千万不复全！\n府吏还家去，上堂拜阿母：“今日大风寒，寒风摧树木，严霜结庭兰。儿今日冥冥，令母在后单。故作不良计，勿复怨鬼神！命如南山石，四体康且直！”\n阿母得闻之，零泪应声落：“汝是大家子，仕宦于台阁。慎勿为妇死，贵贱情何薄！东家有贤女，窈窕艳城郭，阿母为汝求，便复在旦夕。”\n府吏再拜还，长叹空房中，作计乃尔立。转头向户里，渐见愁煎迫。\n其日牛马嘶，新妇入青庐。奄奄黄昏后，寂寂人定初。我命绝今日，魂去尸长留！揽裙脱丝履，举身赴清池。\n府吏闻此事，心知长别离。徘徊庭树下，自挂东南枝。\n两家求合葬，合葬华山傍。东西植松柏，左右种梧桐。枝枝相覆盖，叶叶相交通。中有双飞鸟，自名为鸳鸯。仰头相向鸣，夜夜达五更。行人驻足听，寡妇起彷徨。多谢后世人，戒之慎勿忘。"
  },
  {
    "title": "八阵图",
    "author": {
      "name": "杜甫",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "功盖三分国，名成八阵图。\n江流石不转，遗恨失吞吴。"
  },
  {
    "title": "长相思·其一",
    "author": {
      "name": "李白",
      "dynasty": "唐"
    },
    "type": "ancient",
    "content": "长相思，在长安。\n络纬秋啼金井阑，微霜凄凄簟色寒。\n孤灯不明思欲绝，卷帷望月空长叹。\n美人如花隔云端！\n上有青冥之长天，下有渌水之波澜。\n天长路远魂飞苦，梦魂不到关山难。\n长相思，摧心肝！"
  },
  {
    "title": "望海潮·东南形胜",
    "author": {
      "name": "柳永",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "东南形胜，三吴都会，钱塘自古繁华，烟柳画桥，风帘翠幕，参差十万人家。云树绕堤沙，怒涛卷霜雪，天堑无涯。市列珠玑，户盈罗绮，竞豪奢。\n重湖叠巘清嘉。有三秋桂子，十里荷花。羌管弄晴，菱歌泛夜，嬉嬉钓叟莲娃。千骑拥高牙。乘醉听箫鼓，吟赏烟霞。异日图将好景，归去凤池夸。"
  },
  {
    "title": "氓",
    "author": {
      "name": "佚名",
      "dynasty": "先秦"
    },
    "type": "poetry",
    "content": "氓之蚩蚩，抱布贸丝。匪来贸丝，来即我谋。送子涉淇，至于顿丘。匪我愆期，子无良媒。将子无怒，秋以为期。\n乘彼垝垣，以望复关。不见复关，泣涕涟涟。既见复关，载笑载言。尔卜尔筮，体无咎言。以尔车来，以我贿迁。\n桑之未落，其叶沃若。于嗟鸠兮！无食桑葚。于嗟女兮！无与士耽。士之耽兮，犹可说也。女之耽兮，不可说也。\n桑之落矣，其黄而陨。自我徂尔，三岁食贫。淇水汤汤，渐车帷裳。女也不爽，士贰其行。士也罔极，二三其德。\n三岁为妇，靡室劳矣。夙兴夜寐，靡有朝矣。言既遂矣，至于暴矣。兄弟不知，咥其笑矣。静言思之，躬自悼矣。\n及尔偕老，老使我怨。淇则有岸，隰则有泮。总角之宴，言笑晏晏，信誓旦旦，不思其反。反是不思，亦已焉哉！"
  },
  {
    "title": "捕蛇者说",
    "author": {
      "name": "柳宗元",
      "dynasty": "唐"
    },
    "type": "ancient",
    "content": "永州之野产异蛇：黑质而白章，触草木尽死；以啮人，无御之者。然得而腊之以为饵，可以已大风、挛踠、瘘疠，去死肌，杀三虫。其始太医以王命聚之，岁赋其二。募有能捕之者，当其租入。永之人争奔走焉。\n有蒋氏者，专其利三世矣。问之，则曰：“吾祖死于是，吾父死于是，今吾嗣为之十二年，几死者数矣。”言之貌若甚戚者。余悲之，且曰：“若毒之乎？余将告于莅事者，更若役，复若赋，则何如？”蒋氏大戚，汪然出涕，曰：“君将哀而生之乎？则吾斯役之不幸，未若复吾赋不幸之甚也。向吾不为斯役，则久已病矣。自吾氏三世居是乡，积于今六十岁矣。而乡邻之生日蹙，殚其地之出，竭其庐之入。号呼而转徙，饥渴而顿踣。触风雨，犯寒暑，呼嘘毒疠，往往而死者，相藉也。曩与吾祖居者，今其室十无一焉。与吾父居者，今其室十无二三焉。与吾居十二年者，今其室十无四五焉。非死则徙尔，而吾以捕蛇独存。悍吏之来吾乡，叫嚣乎东西，隳突乎南北；哗然而骇者，虽鸡狗不得宁焉。吾恂恂而起，视其缶，而吾蛇尚存，则弛然而卧。谨食之，时而献焉。退而甘食其土之有，以尽吾齿。盖一岁之犯死者二焉，其余则熙熙而乐，岂若吾乡邻之旦旦有是哉。今虽死乎此，比吾乡邻之死则已后矣，又安敢毒耶？”\n余闻而愈悲，孔子曰：“苛政猛于虎也！”吾尝疑乎是，今以蒋氏观之，犹信。呜呼！孰知赋敛之毒有甚是蛇者乎！故为之说，以俟夫观人风者得焉。"
  },
  {
    "title": "望月有感",
    "author": {
      "name": "白居易",
      "dynasty": "唐"
    },
    "type": "ancient",
    "content": "自河南经乱，关内阻饥，兄弟离散，各在一处。因望月有感，聊书所怀，寄上浮梁大兄、於潜七兄、乌江十五兄，兼示符离及下邽弟妹。\n时难年荒世业空，弟兄羁旅各西东。\n田园寥落干戈后，骨肉流离道路中。\n吊影分为千里雁，辞根散作九秋蓬。\n共看明月应垂泪，一夜乡心五处同。"
  },
  {
    "title": "梦游天姥吟留别",
    "author": {
      "name": "李白",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "海客谈瀛洲，烟涛微茫信难求；\n越人语天姥，云霞明灭或可睹。\n天姥连天向天横，势拔五岳掩赤城。\n天台一万八千丈，对此欲倒东南倾。\n我欲因之梦吴越，一夜飞度镜湖月。\n湖月照我影，送我至剡溪。\n谢公宿处今尚在，渌水荡漾清猿啼。\n脚著谢公屐，身登青云梯。\n半壁见海日，空中闻天鸡。\n千岩万转路不定，迷花倚石忽已暝。\n熊咆龙吟殷岩泉，栗深林兮惊层巅。\n云青青兮欲雨，水澹澹兮生烟。\n列缺霹雳，丘峦崩摧。\n洞天石扉，訇然中开。\n青冥浩荡不见底，日月照耀金银台。\n霓为衣兮风为马，云之君兮纷纷而来下。\n虎鼓瑟兮鸾回车，仙之人兮列如麻。\n忽魂悸以魄动，恍惊起而长嗟。\n惟觉时之枕席，失向来之烟霞。\n世间行乐亦如此，古来万事东流水。\n别君去兮何时还？且放白鹿青崖间，须行即骑访名山。\n安能摧眉折腰事权贵，使我不得开心颜!"
  },
  {
    "title": "端午日",
    "author": {
      "name": "殷尧藩",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "少年佳节倍多情，老去谁知感慨生；\n不效艾符趋习俗，但祈蒲酒话升平。\n鬓丝日日添白头，榴锦年年照眼明；\n千载贤愚同瞬息，几人湮没几垂名。"
  },
  {
    "title": "送东阳马生序",
    "author": {
      "name": "宋濂",
      "dynasty": "明"
    },
    "type": "ancient",
    "content": "余幼时即嗜学。家贫，无从致书以观，每假借于藏书之家，手自笔录，计日以还。天大寒，砚冰坚，手指不可屈伸，弗之怠。录毕，走送之，不敢稍逾约。以是人多以书假余，余因得遍观群书。既加冠，益慕圣贤之道 ，又患无硕师、名人与游，尝趋百里外，从乡之先达执经叩问。先达德隆望尊，门人弟子填其室，未尝稍降辞色。余立侍左右，援疑质理，俯身倾耳以请；或遇其叱咄，色愈恭，礼愈至，不敢出一言以复；俟其欣悦，则又请焉。故余虽愚，卒获有所闻。\n当余之从师也，负箧曳屣，行深山巨谷中，穷冬烈风，大雪深数尺，足肤皲裂而不知。至舍，四支僵劲不能动，媵人持汤沃灌，以衾拥覆，久而乃和。寓逆旅，主人日再食，无鲜肥滋味之享。同舍生皆被绮绣，戴朱缨宝饰之帽，腰白玉之环，左佩刀，右备容臭，烨然若神人；余则缊袍敝衣处其间，略无慕艳意。以中有足乐者，不知口体之奉不若人也。盖余之勤且艰若此。\n今虽耄老，未有所成，犹幸预君子之列，而承天子之宠光，缀公卿之后，日侍坐备顾问，四海亦谬称其氏名，况才之过于余者乎？\n今诸生学于太学，县官日有廪稍之供，父母岁有裘葛之遗，无冻馁之患矣；坐大厦之下而诵诗书，无奔走之劳矣；有司业、博士为之师，未有问而不告，求而不得者也；凡所宜有之书，皆集于此，不必若余之手录，假诸人而后见也。其业有不精，德有不成者，非天质之卑，则心不若余之专耳，岂他人之过哉！\n东阳马生君则，在太学已二年，流辈甚称其贤。余朝京师，生以乡人子谒余，撰长书以为贽，辞甚畅达，与之论辩，言和而色夷。自谓少时用心于学甚劳，是可谓善学者矣！其将归见其亲也，余故道为学之难以告之。谓余勉乡人以学者，余之志也；诋我夸际遇之盛而骄乡人者，岂知余者哉！"
  },
  {
    "title": "送李少府贬峡中王少府贬长沙",
    "author": {
      "name": "高适",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "嗟君此别意何如，驻马衔杯问谪居。\n巫峡啼猿数行泪，衡阳归雁几封书。\n青枫江上秋帆远，白帝城边古木疏。\n圣代即今多雨露，暂时分手莫踌躇。"
  },
  {
    "title": "竹枝词二首·其一",
    "author": {
      "name": "刘禹锡",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "杨柳青青江水平，闻郎江上踏歌声。\n东边日出西边雨，道是无晴却有晴。"
  },
  {
    "title": "李延年歌",
    "author": {
      "name": "李延年",
      "dynasty": "汉"
    },
    "type": "poetry",
    "content": "北方有佳人，绝世而独立。\n一顾倾人城，再顾倾人国。\n宁不知倾城与倾国？佳人难再得。"
  },
  {
    "title": "童趣",
    "author": {
      "name": "沈复",
      "dynasty": "清"
    },
    "type": "ancient",
    "content": "余忆童稚时，能张目对日，明察秋毫，见藐小之物必细察其纹理，故时有物外之趣。\n夏蚊成雷，私拟作群鹤舞于空中，心之所向，则或千或百，果然鹤也；昂首观之，项为之强。又留蚊于素帐中，徐喷以烟，使之冲烟而飞鸣，作青云白鹤观，果如鹤唳云端，为之怡然称快。\n余常于土墙凹凸处，花台小草丛杂处，蹲其身，使与台齐；定神细视，以丛草为林，以虫蚁为兽，以土砾凸者为丘，凹者为壑，神游其中，怡然自得。\n一日，见二虫斗草间，观之，兴正浓，忽有庞然大物，拔山倒树而来，盖一癞蛤蟆，舌一吐而二虫尽为所吞。余年幼，方出神，不觉呀然一惊。神定，捉虾蟆，鞭数十，驱之别院。"
  },
  {
    "title": "赠花卿",
    "author": {
      "name": "杜甫",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "锦城丝管日纷纷，半入江风半入云。\n此曲只应天上有，人间能得几回闻。"
  },
  {
    "title": "过松源晨炊漆公店",
    "author": {
      "name": "杨万里",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "莫言下岭便无难，赚得行人错喜欢。\n正入万山圈子里，一山放过一山拦。"
  },
  {
    "title": "悯农二首",
    "author": {
      "name": "李绅",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "春种一粒粟，秋收万颗子。\n四海无闲田，农夫犹饿死。\n锄禾日当午，汗滴禾下土。\n谁知盘中餐，粒粒皆辛苦？"
  },
  {
    "title": "寡人之于国也",
    "author": {
      "name": "孟子",
      "dynasty": "先秦"
    },
    "type": "ancient",
    "content": "梁惠王曰：“寡人之于国也，尽心焉耳矣。河内凶，则移其民于河东，移其粟于河内；河东凶亦然。察邻国之政，无如寡人之用心者。邻国之民不加少，寡人之民不加多，何也？\n孟子对曰：“王好战，请以战喻。填然鼓之，兵刃既接，弃甲曳兵而走。或百步而后止，或五十步而后止。以五十步笑百步，则何如？”曰：“不可，直不百步耳，是亦走也。”曰：“王如知此，则无望民之多于邻国也。不违农时，谷不可胜食也；数罟不入洿池，鱼鳖不可胜食也；斧斤以时入山林，材木不可胜用也。谷与鱼鳖不可胜食，材木不可胜用，是使民养生丧死无憾也。养生丧死无憾，王道之始也。五亩之宅，树之以桑，五十者可以衣帛矣。鸡豚狗彘之畜，无失其时，七十者可以食肉矣。百亩之田，勿夺其时，数口之家，可以无饥矣；谨庠序之教，申之以孝悌之义，颁白者不负戴于道路矣。七十者衣帛食肉，黎民不饥不寒，然而不王者，未之有也。狗彘食人食而不知检，涂有饿莩而不知发，人死，则曰：‘非我也，岁也。’是何异于刺人而杀之，曰‘非我也，兵也’?王无罪岁，斯天下之民至焉。”"
  },
  {
    "title": "三衢道中",
    "author": {
      "name": "曾几",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "梅子黄时日日晴，小溪泛尽却山行。\n绿阴不减来时路，添得黄鹂四五声。"
  },
  {
    "title": "田家元日",
    "author": {
      "name": "孟浩然",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "昨夜斗回北，今朝岁起东。\n我年已强仕，无禄尚忧农。\n桑野就耕父，荷锄随牧童。\n田家占气候，共说此年丰。"
  },
  {
    "title": "劝学诗",
    "author": {
      "name": "朱熹",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "少年易老学难成，一寸光阴不可轻。\n未觉池塘春草梦，阶前梧叶已秋声。"
  },
  {
    "title": "卜算子·黄州定慧院寓居作",
    "author": {
      "name": "苏轼",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "缺月挂疏桐，漏断人初静。时见幽人独往来，缥缈孤鸿影。\n惊起却回头，有恨无人省。拣尽寒枝不肯栖，寂寞沙洲冷。"
  },
  {
    "title": "凉州词二首",
    "author": {
      "name": "王之涣",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "黄河远上白云间，一片孤城万仞山。\n羌笛何须怨杨柳，春风不度玉门关。\n单于北望拂云堆，杀马登坛祭几回。\n汉家天子今神武，不肯和亲归去来。"
  },
  {
    "title": "端午",
    "author": {
      "name": "李隆基",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "端午临中夏，时清日复长。\n盐梅已佐鼎，曲糵且传觞。\n事古人留迹，年深缕积长。\n当轩知槿茂，向水觉芦香。\n亿兆同归寿，群公共保昌。\n忠贞如不替，贻厥后昆芳。"
  }
]