[
  {
    "title": "后出师表",
    "author": {
      "name": "诸葛亮",
      "dynasty": "蜀"
    },
    "type": "ancient",
    "content": "先帝深虑汉、贼不两立，王业不偏安，故托臣以讨贼也。以先帝之明，量臣之才，固知臣伐贼，才弱敌强也。然不伐贼，王业亦亡。惟坐而待亡，孰与伐之？是故托臣而弗疑也。\n臣受命之日，寝不安席，食不甘味。思惟北征。宜先入南。故五月渡泸，深入不毛，并日而食；臣非不自惜也，顾王业不可得偏安于蜀都，故冒危难，以奉先帝之遗意也，而议者谓为非计。今贼适疲于西，又务于东，兵法乘劳，此进趋之时也。谨陈其事如左：\n高帝明并日月，谋臣渊深，然涉险被创，危然后安。今陛下未及高帝，谋臣不如良、平，而欲以长策取胜，坐定天下，此臣之未解一也。\n刘繇、王朗各据州郡，论安言计，动引圣人，群疑满腹，众难塞胸，今岁不战，明年不征，使孙策坐大，遂并江东，此臣之未解二也。\n曹操智计，殊绝于人，其用兵也，仿佛孙、吴，然困于南阳，险于乌巢，危于祁连，逼于黎阳，几败北山，殆死潼关，然后伪定一时耳。况臣才弱，而欲以不危而定之，此臣之未解三也。\n曹操五攻昌霸不下，四越巢湖不成，任用李服而李服图之，委任夏侯而夏侯败亡，先帝每称操为能，犹有此失，况臣驽下，何能必胜？此臣之未解四也。\n自臣到汉中，中间期年耳，然丧赵云、阳群、马玉、阎芝、丁立、白寿、刘郃、邓铜等及曲长、屯将七十余人，突将、无前、賨叟、青羌、散骑、武骑一千余人。此皆数十年之内所纠合四方之精锐，非一州之所有；若复数年，则损三分之二也，当何以图敌？此臣之未解五也。\n今民穷兵疲，而事不可息；事不可息，则住与行劳费正等。而不及今图之，欲以一州之地，与贼持久，此臣之未解六也。\n夫难平者，事也。昔先帝败军于楚，当此时，曹操拊手，谓天下已定。然后先帝东连吴越，西取巴蜀，举兵北征，夏侯授首，此操之失计，而汉事将成也。然后吴更违盟，关羽毁败，秭归蹉跌，曹丕称帝。凡事如是，难可逆见。臣鞠躬尽瘁，死而后已。至于成败利钝，非臣之明所能逆睹也。"
  },
  {
    "title": "清明即事",
    "author": {
      "name": "孟浩然",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "帝里重清明，人心自愁思。\n车声上路合，柳色东城翠。\n花落草齐生，莺飞蝶双戏。\n空堂坐相忆，酌茗聊代醉。"
  },
  {
    "title": "摸鱼儿·雁丘词",
    "author": {
      "name": "元好问",
      "dynasty": "金"
    },
    "type": "ancient",
    "foreword": "乙丑岁赴试并州，道逢捕雁者云：“今旦获一雁，杀之矣。其脱网者悲鸣不能去，竟自投于地而死。”予因买得之，葬之汾水之上，垒石为识，号曰“雁丘”。同行者多为赋诗，予亦有雁丘词。旧所作无宫商，今改定之。",
    "content": "问世间，情为何物，直教生死相许？天南地北双飞客，老翅几回寒暑。欢乐趣，离别苦，就中更有痴儿女。君应有语：渺万里层云，千山暮雪，只影向谁去？\n横汾路，寂寞当年箫鼓，荒烟依旧平楚。招魂楚些何嗟及，山鬼暗啼风雨。天也妒，未信与，莺儿燕子俱黄土。千秋万古，为留待骚人，狂歌痛饮，来访雁丘处。"
  },
  {
    "title": "采莲曲",
    "author": {
      "name": "王昌龄",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "荷叶罗裙一色裁，芙蓉向脸两边开。\n乱入池中看不见，闻歌始觉有人来。"
  },
  {
    "title": "击鼓",
    "author": {
      "name": "佚名",
      "dynasty": "先秦"
    },
    "type": "poetry",
    "content": "击鼓其镗，踊跃用兵。土国城漕，我独南行。\n从孙子仲，平陈与宋。不我以归，忧心有忡。\n爰居爰处？爰丧其马？于以求之？于林之下。\n死生契阔，与子成说。执子之手，与子偕老。\n于嗟阔兮，不我活兮。于嗟洵兮，不我信兮。"
  },
  {
    "title": "旅夜书怀",
    "author": {
      "name": "杜甫",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "细草微风岸，危樯独夜舟。\n星垂平野阔，月涌大江流。\n名岂文章著，官应老病休。\n飘飘何所似，天地一沙鸥。"
  },
  {
    "title": "八声甘州·对潇潇暮雨洒江天",
    "author": {
      "name": "柳永",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "对潇潇暮雨洒江天，一番洗清秋。渐霜风凄紧，关河冷落，残照当楼。是处红衰翠减，苒苒物华休。唯有长江水，无语东流。\n不忍登高临远，望故乡渺邈，归思难收。叹年来踪迹，何事苦淹留？想佳人妆楼颙望，误几回、天际识归舟。争知我，倚阑杆处，正恁凝愁！"
  },
  {
    "title": "望江南·超然台作",
    "author": {
      "name": "苏轼",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "春未老，风细柳斜斜。试上超然台上看，半壕春水一城花。烟雨暗千家。\n寒食后，酒醒却咨嗟。休对故人思故国，且将新火试新茶。诗酒趁年华。"
  },
  {
    "title": "咏鹅",
    "author": {
      "name": "骆宾王",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "鹅，鹅，鹅，曲项向天歌。\n白毛浮绿水，红掌拨清波。"
  },
  {
    "title": "江畔独步寻花七绝句",
    "author": {
      "name": "杜甫",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "江上被花恼不彻，无处告诉只颠狂。\n走觅南邻爱酒伴，经旬出饮独空床。\n稠花乱蕊畏江滨，行步欹危实怕春。\n诗酒尚堪驱使在，未须料理白头人。\n江深竹静两三家，多事红花映白花。\n报答春光知有处，应须美酒送生涯。\n东望少城花满烟，百花高楼更可怜。\n谁能载酒开金盏，唤取佳人舞绣筵。\n黄师塔前江水东，春光懒困倚微风。\n桃花一簇开无主，可爱深红爱浅红？\n黄四娘家花满蹊，千朵万朵压枝低。\n留连戏蝶时时舞，自在娇莺恰恰啼。\n不是爱花即欲死，只恐花尽老相催。\n繁枝容易纷纷落，嫩蕊商量细细开。"
  },
  {
    "title": "陈元方候袁公",
    "author": {
      "name": "刘义庆",
      "dynasty": "南北朝"
    },
    "type": "ancient",
    "content": "陈元方年十一时，候袁公。袁公问曰：“贤家君在太丘，远近称之，何所履行？”元方曰：“老父在太丘，强者绥之以德，弱者抚之以仁，恣其所安，久而益敬。”袁公曰：“孤往者尝为邺令，正行此事。不知卿家君法孤，孤法卿父？”元方曰：“周公、孔子异世而出，周旋动静，万里如一。周公不师孔子，孔子亦不师周公。”"
  },
  {
    "title": "绝句二首·其二",
    "author": {
      "name": "杜甫",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "江碧鸟逾白，山青花欲燃。\n今春看又过，何日是归年？"
  },
  {
    "title": "九月十日即事",
    "author": {
      "name": "李白",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "昨日登高罢，今朝更举觞。\n菊花何太苦，遭此两重阳？"
  },
  {
    "title": "行香子·述怀",
    "author": {
      "name": "苏轼",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "清夜无尘。月色如银。酒斟时、须满十分。浮名浮利，虚苦劳神。叹隙中驹，石中火，梦中身。\n虽抱文章，开口谁亲。且陶陶、乐尽天真。几时归去，作个闲人。对一张琴，一壶酒，一溪云。"
  },
  {
    "title": "逍遥游",
    "author": {
      "name": "庄周",
      "dynasty": "先秦"
    },
    "type": "ancient",
    "content": "北冥有鱼，其名为鲲。鲲之大，不知其几千里也。化而为鸟，其名为鹏。鹏之背，不知其几千里也，怒而飞，其翼若垂天之云。是鸟也，海运则将徙于南冥。南冥者，天池也。齐谐者，志怪者也。谐之言曰：“鹏之徙于南冥也，水击三千里，抟扶摇而上者九万里，去以六月息者也。”野马也，尘埃也，生物之以息相吹也。天之苍苍，其正色邪？其远而无所至极邪？其视下也，亦若是则已矣。且夫水之积也不厚，则其负大舟也无力。覆杯水于坳堂之上，则芥为之舟；置杯焉则胶，水浅而舟大也。风之积也不厚，则其负大翼也无力。故九万里，则风斯在下矣，而后乃今培风；背负青天而莫之夭阏者，而后乃今将图南。\n蜩与学鸠笑之曰：“我决起而飞，抢榆枋而止，时则不至，而控于地而已矣，奚以之九万里而南为？”适莽苍者，三餐而反，腹犹果然；适百里者宿舂粮，适千里者，三月聚粮。之二虫又何知？\n小知不及大知，小年不及大年。奚以知其然也？朝菌不知晦朔，蟪蛄不知春秋，此小年也。楚之南有冥灵者，以五百岁为春，五百岁为秋。上古有大椿者，以八千岁为春，八千岁为秋。此大年也。而彭祖乃今以久特闻，众人匹之。不亦悲乎！\n汤之问棘也是已：“穷发之北有冥海者，天池也。有鱼焉，其广数千里，未有知其修者，其名为鲲。有鸟焉，其名为鹏。背若泰山，翼若垂天之云。抟扶摇羊角而上者九万里，绝云气，负青天，然后图南，且适南冥也。斥鷃笑之曰：‘彼且奚适也？我腾跃而上，不过数仞而下，翱翔蓬蒿之间，此亦飞之至也。而彼且奚适也？’”此小大之辩也。\n故夫知效一官，行比一乡，德合一君，而征一国者，其自视也亦若此矣。而宋荣子犹然笑之。且举世誉之而不加劝，举世非之而不加沮，定乎内外之分，辩乎荣辱之境，斯已矣。彼其于世，未数数然也。虽然，犹有未树也。夫列子御风而行，泠然善也。旬有五日而后反。彼于致福者，未数数然也。此虽免乎行，犹有所待者也。若夫乘天地之正，而御六气之辩，以游无穷者，彼且恶乎待哉？故曰：至人无己，神人无功，圣人无名。"
  },
  {
    "title": "水龙吟·次韵章质夫杨花词",
    "author": {
      "name": "苏轼",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "似花还似非花，也无人惜从教坠。抛家傍路，思量却是，无情有思。萦损柔肠，困酣娇眼，欲开还闭。梦随风万里，寻郎去处，又还被、莺呼起。\n不恨此花飞尽，恨西园、落红难缀。晓来雨过，遗踪何在？一池萍碎。春色三分，二分尘土，一分流水。细看来，不是杨花，点点是离人泪。"
  },
  {
    "title": "扬州慢·淮左名都",
    "author": {
      "name": "姜夔",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "淳熙丙申至日，予过维扬。夜雪初霁，荠麦弥望。入其城，则四顾萧条，寒水自碧，暮色渐起，戍角悲吟。予怀怆然，感慨今昔，因自度此曲。千岩老人以为有“黍离”之悲也。\n淮左名都，竹西佳处，解鞍少驻初程。过春风十里。尽荠麦青青。自胡马窥江去后，废池乔木，犹厌言兵。渐黄昏，清角吹寒。都在空城。\n杜郎俊赏，算而今、重到须惊。纵豆蔻词工，青楼梦好，难赋深情。二十四桥仍在，波心荡、冷月无声。念桥边红药，年年知为谁生。"
  },
  {
    "title": "西江月·世事一场大梦",
    "author": {
      "name": "苏轼",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "世事一场大梦，人生几度秋凉？夜来风叶已鸣廊。看取眉头鬓上。\n酒贱常愁客少，月明多被云妨。中秋谁与共孤光。把盏凄然北望。"
  },
  {
    "title": "除夜",
    "author": {
      "name": "文天祥",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "乾坤空落落，岁月去堂堂；\n末路惊风雨，穷边饱雪霜。\n命随年欲尽，身与世俱忘；\n无复屠苏梦，挑灯夜未央。"
  },
  {
    "title": "狼",
    "author": {
      "name": "蒲松龄",
      "dynasty": "清"
    },
    "type": "ancient",
    "content": "一屠晚归，担中肉尽，止有剩骨。途中两狼，缀行甚远。\n屠惧，投以骨。一狼得骨止，一狼仍从。复投之，后狼止而前狼又至。骨已尽矣，而两狼之并驱如故。\n屠大窘，恐前后受其敌。顾野有麦场，场主积薪其中，苫蔽成丘。屠乃奔倚其下，弛担持刀。狼不敢前，眈眈相向。\n少时，一狼径去，其一犬坐于前。久之，目似瞑，意暇甚。屠暴起，以刀劈狼首，又数刀毙之。方欲行，转视积薪后，一狼洞其中，意将隧入以攻其后也。身已半入，止露尻尾。屠自后断其股，亦毙之。乃悟前狼假寐，盖以诱敌。\n狼亦黠矣，而顷刻两毙，禽兽之变诈几何哉？止增笑耳。"
  },
  {
    "title": "燕歌行二首·其一",
    "author": {
      "name": "曹丕",
      "dynasty": "魏"
    },
    "type": "poetry",
    "content": "秋风萧瑟天气凉，草木摇落露为霜，群燕辞归鹄南翔。\n念君客游思断肠，慊慊思归恋故乡，君何淹留寄他方？\n贱妾茕茕守空房，忧来思君不敢忘，不觉泪下沾衣裳。\n援琴鸣弦发清商，短歌微吟不能长。\n明月皎皎照我床，星汉西流夜未央。\n牵牛织女遥相望，尔独何辜限河梁。"
  },
  {
    "title": "叶公好龙",
    "author": {
      "name": "刘向",
      "dynasty": "汉"
    },
    "type": "ancient",
    "content": "叶公子高好龙，钩以写龙，凿以写龙，屋室雕文以写龙。于是天龙闻而下之，窥头于牖，施尾于堂。 叶公见之，弃而还走，失其魂魄，五色无主。是叶公非好龙也，好夫似龙而非龙者也。"
  },
  {
    "title": "公输",
    "author": {
      "name": "墨子",
      "dynasty": "先秦"
    },
    "type": "ancient",
    "content": "公输盘为楚造云梯之械，成，将以攻宋。子墨子闻之，起于鲁，行十日十夜，而至于郢，见公输盘。\n公输盘曰：“夫子何命焉为？”\n子墨子曰：“北方有侮臣者，愿借子杀之。”公输盘不说。\n子墨子曰：“请献十金。”\n公输盘曰：“吾义固不杀人。”\n子墨子起，再拜，曰：“请说之。吾从北方闻子为梯，将以攻宋。宋何罪之有？荆国有余于地，而不足于民，杀所不足而争所有余，不可谓智；宋无罪而攻之，不可谓仁；知而不争，不可谓忠。争而不得，不可谓强。义不杀少而杀众，不可谓知类。”\n公输盘服。\n子墨子曰：“然胡不已乎？”\n公输盘曰：“不可，吾既已言之王矣。”\n子墨子曰：“胡不见我于王？”\n公输盘曰：“诺。”\n子墨子见王，曰：“今有人于此，舍其文轩，邻有敝舆而欲窃之；舍其锦绣，邻有短褐而欲窃之；舍其粱肉，邻有糠糟而欲窃之——此为何若人？”\n王曰：“必为有窃疾矣。”\n子墨子曰：“荆之地方五千里，宋之地方五百里，此犹文轩之与敝舆也。荆有云梦，犀兕麋鹿满之，江汉之鱼鳖鼋鼍为天下富，宋所谓无雉兔鲋鱼者也，此犹粱肉之与糠糟也。荆有长松文梓楩楠豫章，宋无长木，此犹锦绣之与短褐也。臣以王吏之攻宋也，为与此同类。”\n王曰：“善哉！虽然，公输盘为我为云梯，必取宋。”\n于是见公输盘。子墨子解带为城，以牒为械，公输盘九设攻城之机变，子墨子九距之。公输盘之攻械尽，子墨子之守圉有余。\n公输盘诎，而曰：“吾知所以距子矣，吾不言。”\n子墨子亦曰：“吾知子之所以距我，吾不言。”\n楚王问其故。\n子墨子曰：“公输子之意不过欲杀臣。杀臣，宋莫能守，乃可攻也。然臣之弟子禽滑厘等三百人，已持臣守圉之器，在宋城上而待楚寇矣。虽杀臣，不能绝也。”\n楚王曰：“善哉。吾请无攻宋矣。”\n子墨子归，过宋。天雨，庇其闾中，守闾者不内也。故曰：治于神者，众人不知其功。争于明者，众人知之。"
  },
  {
    "title": "送别",
    "author": {
      "name": "王维",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "山中相送罢，日暮掩柴扉。\n春草明年绿，王孙归不归？"
  },
  {
    "title": "狱中题壁",
    "author": {
      "name": "谭嗣同",
      "dynasty": "近代"
    },
    "type": "poetry",
    "content": "望门投止思张俭，忍死须臾待杜根。\n我自横刀向天笑，去留肝胆两昆仑。"
  },
  {
    "title": "临江仙·夜饮东坡醒复醉",
    "author": {
      "name": "苏轼",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "夜饮东坡醒复醉，归来仿佛三更。家童鼻息已雷鸣。敲门都不应，倚杖听江声。\n长恨此身非我有，何时忘却营营。夜阑风静縠纹平。小舟从此逝，江海寄余生。"
  },
  {
    "title": "白梅",
    "author": {
      "name": "王冕",
      "dynasty": "元"
    },
    "type": "poetry",
    "content": "冰雪林中著此身，不同桃李混芳尘。\n忽然一夜清香发，散作乾坤万里春。"
  },
  {
    "title": "乞巧",
    "author": {
      "name": "林杰",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "七夕今宵看碧霄，牵牛织女渡河桥。\n家家乞巧望秋月，穿尽红丝几万条。"
  },
  {
    "title": "读书",
    "author": {
      "name": "陆游",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "归志宁无五亩园，读书本意在元元。\n灯前目力虽非昔，犹课蝇头二万言。"
  },
  {
    "title": "问刘十九",
    "author": {
      "name": "白居易",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "绿蚁新醅酒，红泥小火炉。\n晚来天欲雪，能饮一杯无？"
  },
  {
    "title": "新年作",
    "author": {
      "name": "刘长卿",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "乡心新岁切，天畔独潸然。\n老至居人下，春归在客先。\n岭猿同旦暮，江柳共风烟。\n已似长沙傅，从今又几年。"
  },
  {
    "title": "书愤五首·其一",
    "author": {
      "name": "陆游",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "早岁那知世事艰，中原北望气如山。\n楼船夜雪瓜洲渡，铁马秋风大散关。\n塞上长城空自许，镜中衰鬓已先斑。\n出师一表真名世，千载谁堪伯仲间！"
  },
  {
    "title": "寒食野望吟",
    "author": {
      "name": "白居易",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "乌啼鹊噪昏乔木，清明寒食谁家哭。\n风吹旷野纸钱飞，古墓垒垒春草绿。\n棠梨花映白杨树，尽是死生别离处。\n冥冥重泉哭不闻，萧萧暮雨人归去。"
  },
  {
    "title": "夜雪",
    "author": {
      "name": "白居易",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "已讶衾枕冷，复见窗户明。\n夜深知雪重，时闻折竹声。"
  },
  {
    "title": "画眉鸟",
    "author": {
      "name": "欧阳修",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "百啭千声随意移，山花红紫树高低。\n始知锁向金笼听，不及林间自在啼。"
  },
  {
    "title": "赠从弟",
    "author": {
      "name": "刘桢",
      "dynasty": "魏"
    },
    "type": "poetry",
    "content": "亭亭山上松，瑟瑟谷中风。\n风声一何盛，松枝一何劲。\n冰霜正惨凄，终岁常端正。\n岂不罹凝寒，松柏有本性。"
  },
  {
    "title": "蝉",
    "author": {
      "name": "虞世南",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "垂緌饮清露，流响出疏桐。\n居高声自远，非是藉秋风。"
  },
  {
    "title": "金缕衣",
    "author": {
      "name": "佚名",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "劝君莫惜金缕衣，劝君惜取少年时。\n花开堪折直须折，莫待无花空折枝。"
  },
  {
    "title": "菩萨蛮·小山重叠金明灭",
    "author": {
      "name": "温庭筠",
      "dynasty": "唐"
    },
    "type": "ancient",
    "content": "小山重叠金明灭，鬓云欲度香腮雪。懒起画蛾眉，弄妆梳洗迟。\n照花前后镜，花面交相映。新帖绣罗襦，双双金鹧鸪。"
  },
  {
    "title": "荆轲刺秦王",
    "author": {
      "name": "刘向",
      "dynasty": "汉"
    },
    "type": "ancient",
    "content": "秦将王翦破赵，虏赵王，尽收其地，进兵北略地，至燕南界。\n太子丹恐惧，乃请荆卿曰：“秦兵旦暮渡易水，则虽欲长侍足下，岂可得哉？”荆卿曰：“微太子言，臣愿得谒之。今行而无信，则秦未可亲也。夫今樊将军，秦王购之金千斤，邑万家。诚能得樊将军首，与燕督亢之地图，献秦王，秦王必说见臣，臣乃得有以报太子。”太子曰：“樊将军以穷困来归丹，丹不忍以己之私，而伤长者之意，愿足下更虑之！”\n荆轲知太子不忍，乃遂私见樊於期，曰：“秦之遇将军，可谓深矣。父母宗族，皆为戮没。今闻购樊将军之首，金千斤，邑万家，将奈何？”樊将军仰天太息流涕曰：“吾每念，常痛于骨髓，顾计不知所出耳！”轲曰：“今有一言，可以解燕国之患，而报将军之仇者，何如？”於期乃前曰：“为之奈何？”荆轲曰：“愿得将军之首以献秦，秦王必喜而善见臣。臣左手把其袖，而右手揕其胸，然则将军之仇报，而燕国见陵之耻除矣。将军岂有意乎？”樊於期偏袒扼腕而进曰：“此臣之日夜切齿拊心也，乃今得闻教！”遂自刎。\n太子闻之，驰往，伏尸而哭，极哀。既已，不可奈何，乃遂盛樊於期之首，函封之。\n于是太子预求天下之利匕首，得赵人徐夫人之匕首，取之百金，使工以药 淬之。以试人，血濡缕,人无不立死者。乃为装遣荆轲。\n燕国有勇士秦武阳，年十二，杀人，人不敢与忤视。乃令秦武阳为副。\n荆轲有所待，欲与俱，其人居远未来，而为留待。\n顷之未发，太子迟之。疑其有改悔，乃复请之曰：“日以尽矣，荆卿岂无意哉？丹请先遣秦武阳！”荆轲怒， 叱太子曰：“今日往而不反者，竖子也！今提一匕首入不测之强秦，仆所以留者，待吾客与俱。今太子迟之，请辞决矣！”遂发。\n太子及宾客知其事者，皆白衣冠以送之。至易水上，既祖，取道。高渐离击筑，荆轲和而歌，为变徵之声，士皆垂泪涕泣。又前而为歌曰：“风萧萧兮易水寒，壮士一去兮不复还！”复为慷慨羽声，士皆瞋目，发尽上指冠。于是荆轲遂就车而去，终已不顾。\n既至秦，持千金之资币物，厚遗wèi秦王宠臣中庶子蒙嘉。\n嘉为先言于秦王曰：“燕王诚振怖大王之威，不敢兴兵以拒大王，愿举国为内臣。比诸侯之列，给贡职如郡县，而得奉守先王之宗庙。恐惧不敢自陈，谨斩樊於期头，及献燕之督亢之地图，函封，燕王拜送于庭，使使以闻大王。唯大王命之。”\n秦王闻之，大喜。乃朝服，设九宾，见燕使者咸阳宫。\n荆轲奉樊於期头函，而秦武阳奉地图匣，以次进。至陛下，秦武阳色变振恐，群臣怪之，荆轲顾笑武阳，前为谢曰：“北蛮夷之鄙人，未尝见天子，故振慑，愿大王少假借之，使毕使于前。”秦王谓轲曰：“起，取武阳所持图！”\n轲既取图奉之， 发图，图穷而匕首见。因左手把秦王之袖，而右手持匕首揕之。未至身，秦王惊，自引而起，绝袖。拔剑，剑长，操其室。时恐急，剑坚，故不可立拔。\n荆轲逐秦王，秦王还柱而走。群臣惊愕，卒起不意，尽失其度。而秦法，群臣侍殿上者，不得持尺兵；诸郎中执兵，皆陈殿下，非有诏不得上。方急时，不及召下兵，以故荆轲逐秦王，而卒惶急无以击轲，而乃以手共搏之。\n是时，侍医夏无且以其所奉药囊提轲。秦王方还柱走，卒惶急不知所为。左右乃曰：“王负剑！王负剑！”遂拔以击荆轲，断其左股。荆轲废，乃引其匕首提秦王，不中，中柱。秦王复击轲，被八创。\n轲自知事不就，倚柱而笑，箕踞以骂曰：“事所以不成者，乃欲以生劫之，必得约契以报太子也。”\n左右既前，斩荆轲。秦王目眩良久。"
  },
  {
    "title": "行香子·秋与",
    "author": {
      "name": "苏轼",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "昨夜霜风。先入梧桐。浑无处、回避衰容。问公何事，不语书空。但一回醉，一回病，一回慵；\n朝来庭下，光阴如箭，似无言、有意伤侬。都将万事，付与千钟。任酒花白，眼花乱，烛花红。"
  },
  {
    "title": "过秦论",
    "author": {
      "name": "贾谊",
      "dynasty": "汉"
    },
    "type": "ancient",
    "content": "上篇\n秦孝公据崤函之固，拥雍州之地，君臣固守以窥周室，有席卷天下，包举宇内，囊括四海之意，并吞八荒之心。当是时也，商君佐之，内立法度，务耕织，修守战之具；外连衡而斗诸侯。于是秦人拱手而取西河之外。\n孝公既没，惠文、武、昭襄蒙故业，因遗策，南取汉中，西举巴、蜀，东割膏腴之地，北收要害之郡。诸侯恐惧，会盟而谋弱秦，不爱珍器重宝肥饶之地，以致天下之士，合从缔交，相与为一。当此之时，齐有孟尝，赵有平原，楚有春申，魏有信陵。此四君者，皆明智而忠信，宽厚而爱人，尊贤而重士，约从离衡，兼韩、魏、燕、楚、齐、赵、宋、卫、中山之众。于是六国之士，有宁越、徐尚、苏秦、杜赫之属为之谋，齐明、周最、陈轸、召滑、楼缓、翟景、苏厉、乐毅之徒通其意，吴起、孙膑、带佗、倪良、王廖、田忌、廉颇、赵奢之伦制其兵。尝以十倍之地，百万之众，叩关而攻秦。秦人开关延敌，九国之师，逡巡而不敢进。秦无亡矢遗镞之费，而天下诸侯已困矣。于是从散约败，争割地而赂秦。秦有余力而制其弊，追亡逐北，伏尸百万，流血漂橹。因利乘便，宰割天下，分裂山河。强国请服，弱国入朝。延及孝文王、庄襄王，享国之日浅，国家无事。\n及至始皇，奋六世之余烈，振长策而御宇内，吞二周而亡诸侯，履至尊而制六合，执敲扑而鞭笞天下，威振四海。南取百越之地，以为桂林、象郡；百越之君，俯首系颈，委命下吏。乃使蒙恬北筑长城而守藩篱，却匈奴七百余里。胡人不敢南下而牧马，士不敢弯弓而报怨。于是废先王之道，焚百家之言，以愚黔首；隳名城，杀豪杰，收天下之兵，聚之咸阳，销锋镝，铸以为金人十二，以弱天下之民。然后践华为城，因河为池，据亿丈之城，临不测之渊，以为固。良将劲弩守要害之处，信臣精卒陈利兵而谁何。天下已定，始皇之心，自以为关中之固，金城千里，子孙帝王万世之业也。\n始皇既没，余威震于殊俗。然陈涉瓮牖绳枢之子，氓隶之人，而迁徙之徒也；才能不及中人，非有仲尼、墨翟之贤，陶朱、猗顿之富；蹑足行伍之间，而倔起阡陌之中，率疲弊之卒，将数百之众，转而攻秦，斩木为兵，揭竿为旗，天下云集响应，赢粮而景从。山东豪俊遂并起而亡秦族矣。\n且夫天下非小弱也，雍州之地，崤函之固，自若也。陈涉之位，非尊于齐、楚、燕、赵、韩、魏、宋、卫、中山之君也；锄耰棘矜，非铦于钩戟长铩也；谪戍之众，非抗于九国之师也；深谋远虑，行军用兵之道，非及向时之士也。然而成败异变，功业相反，何也?试使山东之国与陈涉度长絜大，比权量力，则不可同年而语矣。然秦以区区之地，致万乘之势，序八州而朝同列，百有余年矣；然后以六合为家，崤函为宫；一夫作难而七庙隳，身死人手，为天下笑者，何也？仁义不施而攻守之势异也。\n中篇\n秦灭周祀，并海内，兼诸侯，南面称帝，以养四海。天下之士，斐然向风。若是，何也？曰：近古之无王者久矣。周室卑微，五霸既灭，令不行于天下。是以诸侯力政，强凌弱，众暴寡，兵革不休，士民罢弊。今秦南面而王天下，是上有天子也。既元元之民冀得安其性命，莫不虚心而仰上。当此之时，专威定功，安危之本，在于此矣。\n秦王怀贪鄙之心，行自奋之智，不信功臣，不亲士民，废王道而立私爱，焚文书而酷刑法，先诈力而后仁义，以暴虐为天下始。夫兼并者高诈力，安危者贵顺权，此言取与守不同术也。秦离战国而王天下，其道不易，其政不改，是其所以取之守之者无异也。孤独而有之，故其亡可立而待也。借使秦王论上世之事，并殷、周之迹，以制御其政，后虽有淫骄之主，犹未有倾危之患也。故三王之建天下，名号显美，功业长久。\n今秦二世立，天下莫不引领而观其政。夫寒者利裋褐，而饥者甘糟糠。天下嚣嚣，新主之资也。此言劳民之易为仁也。向使二世有庸主之行而任忠贤，臣主一心而忧海内之患，缟素而正先帝之过；裂地分民以封功臣之后，建国立君以礼天下；虚囹圄而免刑戮，去收孥污秽之罪，使各反其乡里；发仓廪，散财币，以振孤独穷困之士；轻赋少事，以佐百姓之急；约法省刑，以持其后，使天下之人皆得自新，更节修行，各慎其身；塞万民之望，而以盛德与天下，天下息矣。即四海之内皆欢然各自安乐其处，惟恐有变。虽有狡害之民，无离上之心，则不轨之臣无以饰其智，而暴乱之奸弭矣。\n二世不行此术，而重以无道：坏宗庙与民，更始作阿房之宫；繁刑严诛，吏治刻深；赏罚不当，赋敛无度。天下多事，吏不能纪；百姓困穷，而主不收恤。然后奸伪并起，而上下相遁；蒙罪者众，刑戮相望于道，而天下苦之。自群卿以下至于众庶，人怀自危之心，亲处穷苦之实，咸不安其位，故易动也。是以陈涉不用汤、武之贤，不借公侯之尊，奋臂于大泽，而天下响应者，其民危也。\n故先王者，见终始不变，知存亡之由。是以牧民之道，务在安之而已矣。下虽有逆行之臣，必无响应之助。故曰：“安民可与为义，而危民易与为非”，此之谓也。贵为天子，富有四海，身在于戮者，正之非也。是二世之过也。\n下篇\n秦兼诸侯山东三十余郡，脩津关，据险塞，缮甲兵而守之。然陈涉率散乱之众数百，奋臂大呼，不用弓戟之兵，鉏耰白梃，望屋而食，横行天下。秦人阻险不守，关梁不闭，长戟不刺，强弩不射。楚师深入，战于鸿门，曾无藩篱之难。于是山东诸侯并起，豪俊相立。秦使章邯将而东征，章邯因其三军之众，要市于外，以谋其上。群臣之不相信，可见于此矣。子婴立，遂不悟。借使子婴有庸主之材而仅得中佐，山东虽乱，三秦之地可全而有，宗庙之祀宜未绝也。\n秦地被山带河以为固，四塞之国也。自缪公以来至于秦王二十余君，常为诸侯雄。此岂世贤哉？其势居然也。且天下尝同心并力攻秦矣，然困于险阻而不能进者，岂勇力智慧不足哉？形不利、势不便也。秦虽小邑，伐并大城，得阨塞而守之。诸侯起于匹夫，以利会，非有素王之行也。其交未亲，其民未附，名曰亡秦，其实利之也。彼见秦阻之难犯，必退师。案土息民以待其弊，收弱扶罢以令大国之君，不患不得意于海内。贵为天子，富有四海，而身为禽者，救败非也。\n秦王足己而不问，遂过而不变。二世受之，因而不改，暴虐以重祸。子婴孤立无亲，危弱无辅。三主之惑，终身不悟，亡不亦宜乎？当此时也，也非无深谋远虑知化之士也，然所以不敢尽忠指过者，秦俗多忌讳之禁也，——忠言未卒于口而身糜没矣。故使天下之士倾耳而听，重足而立，阖口而不言。是以三主失道，而忠臣不谏，智士不谋也。天下已乱，奸不上闻，岂不悲哉！先王知壅蔽之伤国也，故置公卿、大夫、士，以饰法设刑而天下治。其强也，禁暴诛乱而天下服；其弱也，王霸征而诸侯从；其削也，内守外附而社稷存。故秦之盛也，繁法严刑而天下震；及其衰也，百姓怨而海内叛矣。故周王序得其道，千余载不绝；秦本末并失，故不能长。由是观之，安危之统相去远矣。\n鄙谚曰：“前事之不忘，后事之师也。”是以君子为国，观之上古，验之当世，参之人事，察盛衰之理，审权势之宜，去就有序，变化因时，故旷日长久而社稷安矣。"
  },
  {
    "title": "临江仙·梦后楼台高锁",
    "author": {
      "name": "晏几道",
      "dynasty": "宋"
    },
    "type": "ancient",
    "content": "梦后楼台高锁，酒醒帘幕低垂。去年春恨却来时。落花人独立，微雨燕双飞。\n记得小蘋初见，两重心字罗衣。琵琶弦上说相思。当时明月在，曾照彩云归。"
  },
  {
    "title": "陌上桑",
    "author": {
      "name": "乐府诗集",
      "dynasty": "汉"
    },
    "type": "ancient",
    "content": "日出东南隅，照我秦氏楼。秦氏有好女，自名为罗敷。罗敷喜蚕桑，采桑城南隅。青丝为笼系，桂枝为笼钩。头上倭堕髻，耳中明月珠。缃绮为下裙，紫绮为上襦。行者见罗敷，下担捋髭须。少年见罗敷，脱帽著帩头。耕者忘其犁，锄者忘其锄。来归相怨怒，但坐观罗敷。\n使君从南来，五马立踟蹰。使君遣吏往，问是谁家姝？“秦氏有好女，自名为罗敷。”“罗敷年几何？”“二十尚不足，十五颇有余”。使君谢罗敷：“宁可共载不？罗敷前致辞：“使君一何愚！使君自有妇，罗敷自有夫！”\n“东方千余骑，夫婿居上头。何用识夫婿？白马从骊驹，青丝系马尾，黄金络马头；腰中鹿卢剑，可值千万余。十五府小吏，二十朝大夫，三十侍中郎，四十专城居。为人洁白皙，鬑鬑颇有须。盈盈公府步，冉冉府中趋。坐中数千人，皆言夫婿殊。”"
  },
  {
    "title": "终南别业",
    "author": {
      "name": "王维",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "中岁颇好道，晚家南山陲。\n兴来每独往，胜事空自知。\n行到水穷处，坐看云起时。\n偶然值林叟，谈笑无还期。"
  },
  {
    "title": "登岳阳楼二首",
    "author": {
      "name": "陈与义",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "洞庭之东江水西，帘旌不动夕阳迟。\n登临吴蜀横分地，徙倚湖山欲暮时。\n万里来游还望远，三年多难更凭危。\n白头吊古风霜里，老木沧波无限悲。\n天入平湖晴不风，夕帆和雁正浮空。\n楼头客子杪秋后，日落君山元气中。\n北望可堪回白首，南游聊得看丹枫。\n翰林物色分留少，诗到巴陵还未工。"
  },
  {
    "title": "鲁山山行",
    "author": {
      "name": "梅尧臣",
      "dynasty": "宋"
    },
    "type": "poetry",
    "content": "适与野情惬，千山高复低。\n好峰随处改，幽径独行迷。\n霜落熊升树，林空鹿饮溪。\n人家在何许？云外一声鸡。"
  },
  {
    "title": "左迁至蓝关示侄孙湘",
    "author": {
      "name": "韩愈",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "一封朝奏九重天，夕贬潮州路八千。\n欲为圣明除弊事，肯将衰朽惜残年！\n云横秦岭家何在？雪拥蓝关马不前。\n知汝远来应有意，好收吾骨瘴江边。"
  },
  {
    "title": "清平调·其一",
    "author": {
      "name": "李白",
      "dynasty": "唐"
    },
    "type": "poetry",
    "content": "云想衣裳花想容，春风拂槛露华浓。\n若非群玉山头见，会向瑶台月下逢。"
  },
  {
    "title": "折桂令·春情",
    "author": {
      "name": "徐再思",
      "dynasty": "元"
    },
    "type": "ancient",
    "content": "平生不会相思，才会相思，便害相思。\n身似浮云，心如飞絮，气若游丝。\n空一缕余香在此，盼千金游子何之。\n证候来时，正是何时？灯半昏时，月半明时。"
  }
]